###################################################################

# Created by write_sdc on Sat Apr 16 22:42:46 2022

###################################################################
set sdc_version 2.1

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current mA
set_wire_load_mode segmented
set_max_transition 3 [current_design]
set_driving_cell -lib_cell HPDWUW1416DGP -pin PAD [get_ports clk]
set_driving_cell -lib_cell HPDWUW1416DGP -pin PAD [get_ports rst]
set_driving_cell -lib_cell HPDWUW1416DGP -pin PAD [get_ports {cur_input0[15]}]
set_driving_cell -lib_cell HPDWUW1416DGP -pin PAD [get_ports {cur_input0[14]}]
set_driving_cell -lib_cell HPDWUW1416DGP -pin PAD [get_ports {cur_input0[13]}]
set_driving_cell -lib_cell HPDWUW1416DGP -pin PAD [get_ports {cur_input0[12]}]
set_driving_cell -lib_cell HPDWUW1416DGP -pin PAD [get_ports {cur_input0[11]}]
set_driving_cell -lib_cell HPDWUW1416DGP -pin PAD [get_ports {cur_input0[10]}]
set_driving_cell -lib_cell HPDWUW1416DGP -pin PAD [get_ports {cur_input0[9]}]
set_driving_cell -lib_cell HPDWUW1416DGP -pin PAD [get_ports {cur_input0[8]}]
set_driving_cell -lib_cell HPDWUW1416DGP -pin PAD [get_ports {cur_input0[7]}]
set_driving_cell -lib_cell HPDWUW1416DGP -pin PAD [get_ports {cur_input0[6]}]
set_driving_cell -lib_cell HPDWUW1416DGP -pin PAD [get_ports {cur_input0[5]}]
set_driving_cell -lib_cell HPDWUW1416DGP -pin PAD [get_ports {cur_input0[4]}]
set_driving_cell -lib_cell HPDWUW1416DGP -pin PAD [get_ports {cur_input0[3]}]
set_driving_cell -lib_cell HPDWUW1416DGP -pin PAD [get_ports {cur_input0[2]}]
set_driving_cell -lib_cell HPDWUW1416DGP -pin PAD [get_ports {cur_input0[1]}]
set_driving_cell -lib_cell HPDWUW1416DGP -pin PAD [get_ports {cur_input0[0]}]
set_driving_cell -lib_cell HPDWUW1416DGP -pin PAD [get_ports {cur_input1[15]}]
set_driving_cell -lib_cell HPDWUW1416DGP -pin PAD [get_ports {cur_input1[14]}]
set_driving_cell -lib_cell HPDWUW1416DGP -pin PAD [get_ports {cur_input1[13]}]
set_driving_cell -lib_cell HPDWUW1416DGP -pin PAD [get_ports {cur_input1[12]}]
set_driving_cell -lib_cell HPDWUW1416DGP -pin PAD [get_ports {cur_input1[11]}]
set_driving_cell -lib_cell HPDWUW1416DGP -pin PAD [get_ports {cur_input1[10]}]
set_driving_cell -lib_cell HPDWUW1416DGP -pin PAD [get_ports {cur_input1[9]}]
set_driving_cell -lib_cell HPDWUW1416DGP -pin PAD [get_ports {cur_input1[8]}]
set_driving_cell -lib_cell HPDWUW1416DGP -pin PAD [get_ports {cur_input1[7]}]
set_driving_cell -lib_cell HPDWUW1416DGP -pin PAD [get_ports {cur_input1[6]}]
set_driving_cell -lib_cell HPDWUW1416DGP -pin PAD [get_ports {cur_input1[5]}]
set_driving_cell -lib_cell HPDWUW1416DGP -pin PAD [get_ports {cur_input1[4]}]
set_driving_cell -lib_cell HPDWUW1416DGP -pin PAD [get_ports {cur_input1[3]}]
set_driving_cell -lib_cell HPDWUW1416DGP -pin PAD [get_ports {cur_input1[2]}]
set_driving_cell -lib_cell HPDWUW1416DGP -pin PAD [get_ports {cur_input1[1]}]
set_driving_cell -lib_cell HPDWUW1416DGP -pin PAD [get_ports {cur_input1[0]}]
set_driving_cell -lib_cell HPDWUW1416DGP -pin PAD [get_ports {ref0[3]}]
set_driving_cell -lib_cell HPDWUW1416DGP -pin PAD [get_ports {ref0[2]}]
set_driving_cell -lib_cell HPDWUW1416DGP -pin PAD [get_ports {ref0[1]}]
set_driving_cell -lib_cell HPDWUW1416DGP -pin PAD [get_ports {ref0[0]}]
set_driving_cell -lib_cell HPDWUW1416DGP -pin PAD [get_ports {ref1[3]}]
set_driving_cell -lib_cell HPDWUW1416DGP -pin PAD [get_ports {ref1[2]}]
set_driving_cell -lib_cell HPDWUW1416DGP -pin PAD [get_ports {ref1[1]}]
set_driving_cell -lib_cell HPDWUW1416DGP -pin PAD [get_ports {ref1[0]}]
set_driving_cell -lib_cell HPDWUW1416DGP -pin PAD [get_ports {ref2[3]}]
set_driving_cell -lib_cell HPDWUW1416DGP -pin PAD [get_ports {ref2[2]}]
set_driving_cell -lib_cell HPDWUW1416DGP -pin PAD [get_ports {ref2[1]}]
set_driving_cell -lib_cell HPDWUW1416DGP -pin PAD [get_ports {ref2[0]}]
set_driving_cell -lib_cell HPDWUW1416DGP -pin PAD [get_ports {ref3[3]}]
set_driving_cell -lib_cell HPDWUW1416DGP -pin PAD [get_ports {ref3[2]}]
set_driving_cell -lib_cell HPDWUW1416DGP -pin PAD [get_ports {ref3[1]}]
set_driving_cell -lib_cell HPDWUW1416DGP -pin PAD [get_ports {ref3[0]}]
set_driving_cell -lib_cell HPDWUW1416DGP -pin PAD [get_ports {ref4[3]}]
set_driving_cell -lib_cell HPDWUW1416DGP -pin PAD [get_ports {ref4[2]}]
set_driving_cell -lib_cell HPDWUW1416DGP -pin PAD [get_ports {ref4[1]}]
set_driving_cell -lib_cell HPDWUW1416DGP -pin PAD [get_ports {ref4[0]}]
set_driving_cell -lib_cell HPDWUW1416DGP -pin PAD [get_ports {ref5[3]}]
set_driving_cell -lib_cell HPDWUW1416DGP -pin PAD [get_ports {ref5[2]}]
set_driving_cell -lib_cell HPDWUW1416DGP -pin PAD [get_ports {ref5[1]}]
set_driving_cell -lib_cell HPDWUW1416DGP -pin PAD [get_ports {ref5[0]}]
set_driving_cell -lib_cell HPDWUW1416DGP -pin PAD [get_ports {ref6[3]}]
set_driving_cell -lib_cell HPDWUW1416DGP -pin PAD [get_ports {ref6[2]}]
set_driving_cell -lib_cell HPDWUW1416DGP -pin PAD [get_ports {ref6[1]}]
set_driving_cell -lib_cell HPDWUW1416DGP -pin PAD [get_ports {ref6[0]}]
set_driving_cell -lib_cell HPDWUW1416DGP -pin PAD [get_ports {ref7[3]}]
set_driving_cell -lib_cell HPDWUW1416DGP -pin PAD [get_ports {ref7[2]}]
set_driving_cell -lib_cell HPDWUW1416DGP -pin PAD [get_ports {ref7[1]}]
set_driving_cell -lib_cell HPDWUW1416DGP -pin PAD [get_ports {ref7[0]}]
set_driving_cell -lib_cell HPDWUW1416DGP -pin PAD [get_ports {ref8[3]}]
set_driving_cell -lib_cell HPDWUW1416DGP -pin PAD [get_ports {ref8[2]}]
set_driving_cell -lib_cell HPDWUW1416DGP -pin PAD [get_ports {ref8[1]}]
set_driving_cell -lib_cell HPDWUW1416DGP -pin PAD [get_ports {ref8[0]}]
set_driving_cell -lib_cell HPDWUW1416DGP -pin PAD [get_ports {ref9[3]}]
set_driving_cell -lib_cell HPDWUW1416DGP -pin PAD [get_ports {ref9[2]}]
set_driving_cell -lib_cell HPDWUW1416DGP -pin PAD [get_ports {ref9[1]}]
set_driving_cell -lib_cell HPDWUW1416DGP -pin PAD [get_ports {ref9[0]}]
set_driving_cell -lib_cell HPDWUW1416DGP -pin PAD [get_ports {ref10[3]}]
set_driving_cell -lib_cell HPDWUW1416DGP -pin PAD [get_ports {ref10[2]}]
set_driving_cell -lib_cell HPDWUW1416DGP -pin PAD [get_ports {ref10[1]}]
set_driving_cell -lib_cell HPDWUW1416DGP -pin PAD [get_ports {ref10[0]}]
set_driving_cell -lib_cell HPDWUW1416DGP -pin PAD [get_ports {ref11[3]}]
set_driving_cell -lib_cell HPDWUW1416DGP -pin PAD [get_ports {ref11[2]}]
set_driving_cell -lib_cell HPDWUW1416DGP -pin PAD [get_ports {ref11[1]}]
set_driving_cell -lib_cell HPDWUW1416DGP -pin PAD [get_ports {ref11[0]}]
set_driving_cell -lib_cell HPDWUW1416DGP -pin PAD [get_ports {ref12[3]}]
set_driving_cell -lib_cell HPDWUW1416DGP -pin PAD [get_ports {ref12[2]}]
set_driving_cell -lib_cell HPDWUW1416DGP -pin PAD [get_ports {ref12[1]}]
set_driving_cell -lib_cell HPDWUW1416DGP -pin PAD [get_ports {ref12[0]}]
set_driving_cell -lib_cell HPDWUW1416DGP -pin PAD [get_ports {ref13[3]}]
set_driving_cell -lib_cell HPDWUW1416DGP -pin PAD [get_ports {ref13[2]}]
set_driving_cell -lib_cell HPDWUW1416DGP -pin PAD [get_ports {ref13[1]}]
set_driving_cell -lib_cell HPDWUW1416DGP -pin PAD [get_ports {ref13[0]}]
set_driving_cell -lib_cell HPDWUW1416DGP -pin PAD [get_ports {ref14[3]}]
set_driving_cell -lib_cell HPDWUW1416DGP -pin PAD [get_ports {ref14[2]}]
set_driving_cell -lib_cell HPDWUW1416DGP -pin PAD [get_ports {ref14[1]}]
set_driving_cell -lib_cell HPDWUW1416DGP -pin PAD [get_ports {ref14[0]}]
set_driving_cell -lib_cell HPDWUW1416DGP -pin PAD [get_ports {ref15[3]}]
set_driving_cell -lib_cell HPDWUW1416DGP -pin PAD [get_ports {ref15[2]}]
set_driving_cell -lib_cell HPDWUW1416DGP -pin PAD [get_ports {ref15[1]}]
set_driving_cell -lib_cell HPDWUW1416DGP -pin PAD [get_ports {ref15[0]}]
set_driving_cell -lib_cell HPDWUW1416DGP -pin PAD [get_ports {ref16[3]}]
set_driving_cell -lib_cell HPDWUW1416DGP -pin PAD [get_ports {ref16[2]}]
set_driving_cell -lib_cell HPDWUW1416DGP -pin PAD [get_ports {ref16[1]}]
set_driving_cell -lib_cell HPDWUW1416DGP -pin PAD [get_ports {ref16[0]}]
set_driving_cell -lib_cell HPDWUW1416DGP -pin PAD [get_ports {ref17[3]}]
set_driving_cell -lib_cell HPDWUW1416DGP -pin PAD [get_ports {ref17[2]}]
set_driving_cell -lib_cell HPDWUW1416DGP -pin PAD [get_ports {ref17[1]}]
set_driving_cell -lib_cell HPDWUW1416DGP -pin PAD [get_ports {ref17[0]}]
set_driving_cell -lib_cell HPDWUW1416DGP -pin PAD [get_ports {ref18[3]}]
set_driving_cell -lib_cell HPDWUW1416DGP -pin PAD [get_ports {ref18[2]}]
set_driving_cell -lib_cell HPDWUW1416DGP -pin PAD [get_ports {ref18[1]}]
set_driving_cell -lib_cell HPDWUW1416DGP -pin PAD [get_ports {ref18[0]}]
set_driving_cell -lib_cell HPDWUW1416DGP -pin PAD [get_ports {ref19[3]}]
set_driving_cell -lib_cell HPDWUW1416DGP -pin PAD [get_ports {ref19[2]}]
set_driving_cell -lib_cell HPDWUW1416DGP -pin PAD [get_ports {ref19[1]}]
set_driving_cell -lib_cell HPDWUW1416DGP -pin PAD [get_ports {ref19[0]}]
set_driving_cell -lib_cell HPDWUW1416DGP -pin PAD [get_ports {ref20[3]}]
set_driving_cell -lib_cell HPDWUW1416DGP -pin PAD [get_ports {ref20[2]}]
set_driving_cell -lib_cell HPDWUW1416DGP -pin PAD [get_ports {ref20[1]}]
set_driving_cell -lib_cell HPDWUW1416DGP -pin PAD [get_ports {ref20[0]}]
set_driving_cell -lib_cell HPDWUW1416DGP -pin PAD [get_ports {ref21[3]}]
set_driving_cell -lib_cell HPDWUW1416DGP -pin PAD [get_ports {ref21[2]}]
set_driving_cell -lib_cell HPDWUW1416DGP -pin PAD [get_ports {ref21[1]}]
set_driving_cell -lib_cell HPDWUW1416DGP -pin PAD [get_ports {ref21[0]}]
set_driving_cell -lib_cell HPDWUW1416DGP -pin PAD [get_ports {ref22[3]}]
set_driving_cell -lib_cell HPDWUW1416DGP -pin PAD [get_ports {ref22[2]}]
set_driving_cell -lib_cell HPDWUW1416DGP -pin PAD [get_ports {ref22[1]}]
set_driving_cell -lib_cell HPDWUW1416DGP -pin PAD [get_ports {ref22[0]}]
set_load -pin_load 1.4272 [get_ports finish_flag]
set_load -pin_load 1.4272 [get_ports ber]
set_load -pin_load 1.4272 [get_ports {cur_ad[22]}]
set_load -pin_load 1.4272 [get_ports {cur_ad[21]}]
set_load -pin_load 1.4272 [get_ports {cur_ad[20]}]
set_load -pin_load 1.4272 [get_ports {cur_ad[19]}]
set_load -pin_load 1.4272 [get_ports {cur_ad[18]}]
set_load -pin_load 1.4272 [get_ports {cur_ad[17]}]
set_load -pin_load 1.4272 [get_ports {cur_ad[16]}]
set_load -pin_load 1.4272 [get_ports {cur_ad[15]}]
set_load -pin_load 1.4272 [get_ports {cur_ad[14]}]
set_load -pin_load 1.4272 [get_ports {cur_ad[13]}]
set_load -pin_load 1.4272 [get_ports {cur_ad[12]}]
set_load -pin_load 1.4272 [get_ports {cur_ad[11]}]
set_load -pin_load 1.4272 [get_ports {cur_ad[10]}]
set_load -pin_load 1.4272 [get_ports {cur_ad[9]}]
set_load -pin_load 1.4272 [get_ports {cur_ad[8]}]
set_load -pin_load 1.4272 [get_ports {cur_ad[7]}]
set_load -pin_load 1.4272 [get_ports {cur_ad[6]}]
set_load -pin_load 1.4272 [get_ports {cur_ad[5]}]
set_load -pin_load 1.4272 [get_ports {cur_ad[4]}]
set_load -pin_load 1.4272 [get_ports {cur_ad[3]}]
set_load -pin_load 1.4272 [get_ports {cur_ad[2]}]
set_load -pin_load 1.4272 [get_ports {cur_ad[1]}]
set_load -pin_load 1.4272 [get_ports {cur_ad[0]}]
set_load -pin_load 1.4272 [get_ports {ref_ad[22]}]
set_load -pin_load 1.4272 [get_ports {ref_ad[21]}]
set_load -pin_load 1.4272 [get_ports {ref_ad[20]}]
set_load -pin_load 1.4272 [get_ports {ref_ad[19]}]
set_load -pin_load 1.4272 [get_ports {ref_ad[18]}]
set_load -pin_load 1.4272 [get_ports {ref_ad[17]}]
set_load -pin_load 1.4272 [get_ports {ref_ad[16]}]
set_load -pin_load 1.4272 [get_ports {ref_ad[15]}]
set_load -pin_load 1.4272 [get_ports {ref_ad[14]}]
set_load -pin_load 1.4272 [get_ports {ref_ad[13]}]
set_load -pin_load 1.4272 [get_ports {ref_ad[12]}]
set_load -pin_load 1.4272 [get_ports {ref_ad[11]}]
set_load -pin_load 1.4272 [get_ports {ref_ad[10]}]
set_load -pin_load 1.4272 [get_ports {ref_ad[9]}]
set_load -pin_load 1.4272 [get_ports {ref_ad[8]}]
set_load -pin_load 1.4272 [get_ports {ref_ad[7]}]
set_load -pin_load 1.4272 [get_ports {ref_ad[6]}]
set_load -pin_load 1.4272 [get_ports {ref_ad[5]}]
set_load -pin_load 1.4272 [get_ports {ref_ad[4]}]
set_load -pin_load 1.4272 [get_ports {ref_ad[3]}]
set_load -pin_load 1.4272 [get_ports {ref_ad[2]}]
set_load -pin_load 1.4272 [get_ports {ref_ad[1]}]
set_load -pin_load 1.4272 [get_ports {ref_ad[0]}]
set_load -pin_load 1.4272 [get_ports {min_sad0[13]}]
set_load -pin_load 1.4272 [get_ports {min_sad0[12]}]
set_load -pin_load 1.4272 [get_ports {min_sad0[11]}]
set_load -pin_load 1.4272 [get_ports {min_sad0[10]}]
set_load -pin_load 1.4272 [get_ports {min_sad0[9]}]
set_load -pin_load 1.4272 [get_ports {min_sad0[8]}]
set_load -pin_load 1.4272 [get_ports {min_sad0[7]}]
set_load -pin_load 1.4272 [get_ports {min_sad0[6]}]
set_load -pin_load 1.4272 [get_ports {min_sad0[5]}]
set_load -pin_load 1.4272 [get_ports {min_sad0[4]}]
set_load -pin_load 1.4272 [get_ports {min_sad0[3]}]
set_load -pin_load 1.4272 [get_ports {min_sad0[2]}]
set_load -pin_load 1.4272 [get_ports {min_sad0[1]}]
set_load -pin_load 1.4272 [get_ports {min_sad0[0]}]
set_load -pin_load 1.4272 [get_ports {min_sad1[13]}]
set_load -pin_load 1.4272 [get_ports {min_sad1[12]}]
set_load -pin_load 1.4272 [get_ports {min_sad1[11]}]
set_load -pin_load 1.4272 [get_ports {min_sad1[10]}]
set_load -pin_load 1.4272 [get_ports {min_sad1[9]}]
set_load -pin_load 1.4272 [get_ports {min_sad1[8]}]
set_load -pin_load 1.4272 [get_ports {min_sad1[7]}]
set_load -pin_load 1.4272 [get_ports {min_sad1[6]}]
set_load -pin_load 1.4272 [get_ports {min_sad1[5]}]
set_load -pin_load 1.4272 [get_ports {min_sad1[4]}]
set_load -pin_load 1.4272 [get_ports {min_sad1[3]}]
set_load -pin_load 1.4272 [get_ports {min_sad1[2]}]
set_load -pin_load 1.4272 [get_ports {min_sad1[1]}]
set_load -pin_load 1.4272 [get_ports {min_sad1[0]}]
set_load -pin_load 1.4272 [get_ports finish_a_cur0]
set_load -pin_load 1.4272 [get_ports finish_a_cur1]
set_load -pin_load 1.4272 [get_ports {mv_x0[3]}]
set_load -pin_load 1.4272 [get_ports {mv_x0[2]}]
set_load -pin_load 1.4272 [get_ports {mv_x0[1]}]
set_load -pin_load 1.4272 [get_ports {mv_x0[0]}]
set_load -pin_load 1.4272 [get_ports {mv_y0[3]}]
set_load -pin_load 1.4272 [get_ports {mv_y0[2]}]
set_load -pin_load 1.4272 [get_ports {mv_y0[1]}]
set_load -pin_load 1.4272 [get_ports {mv_y0[0]}]
set_load -pin_load 1.4272 [get_ports {mv_x1[3]}]
set_load -pin_load 1.4272 [get_ports {mv_x1[2]}]
set_load -pin_load 1.4272 [get_ports {mv_x1[1]}]
set_load -pin_load 1.4272 [get_ports {mv_x1[0]}]
set_load -pin_load 1.4272 [get_ports {mv_y1[3]}]
set_load -pin_load 1.4272 [get_ports {mv_y1[2]}]
set_load -pin_load 1.4272 [get_ports {mv_y1[1]}]
set_load -pin_load 1.4272 [get_ports {mv_y1[0]}]
set_ideal_network [get_ports rst]
create_clock [get_ports clk]  -period 5  -waveform {0 2.5}
set_clock_latency 0.3  [get_clocks clk]
set_clock_latency -source 4  [get_clocks clk]
set_clock_uncertainty 0.25  [get_clocks clk]
set_clock_transition -max -rise 0.1 [get_clocks clk]
set_clock_transition -max -fall 0.1 [get_clocks clk]
set_clock_transition -min -rise 0.1 [get_clocks clk]
set_clock_transition -min -fall 0.1 [get_clocks clk]
set_input_delay -clock clk  -max 2.5  [get_ports rst]
set_input_delay -clock clk  -max 2.5  [get_ports {cur_input0[15]}]
set_input_delay -clock clk  -max 2.5  [get_ports {cur_input0[14]}]
set_input_delay -clock clk  -max 2.5  [get_ports {cur_input0[13]}]
set_input_delay -clock clk  -max 2.5  [get_ports {cur_input0[12]}]
set_input_delay -clock clk  -max 2.5  [get_ports {cur_input0[11]}]
set_input_delay -clock clk  -max 2.5  [get_ports {cur_input0[10]}]
set_input_delay -clock clk  -max 2.5  [get_ports {cur_input0[9]}]
set_input_delay -clock clk  -max 2.5  [get_ports {cur_input0[8]}]
set_input_delay -clock clk  -max 2.5  [get_ports {cur_input0[7]}]
set_input_delay -clock clk  -max 2.5  [get_ports {cur_input0[6]}]
set_input_delay -clock clk  -max 2.5  [get_ports {cur_input0[5]}]
set_input_delay -clock clk  -max 2.5  [get_ports {cur_input0[4]}]
set_input_delay -clock clk  -max 2.5  [get_ports {cur_input0[3]}]
set_input_delay -clock clk  -max 2.5  [get_ports {cur_input0[2]}]
set_input_delay -clock clk  -max 2.5  [get_ports {cur_input0[1]}]
set_input_delay -clock clk  -max 2.5  [get_ports {cur_input0[0]}]
set_input_delay -clock clk  -max 2.5  [get_ports {cur_input1[15]}]
set_input_delay -clock clk  -max 2.5  [get_ports {cur_input1[14]}]
set_input_delay -clock clk  -max 2.5  [get_ports {cur_input1[13]}]
set_input_delay -clock clk  -max 2.5  [get_ports {cur_input1[12]}]
set_input_delay -clock clk  -max 2.5  [get_ports {cur_input1[11]}]
set_input_delay -clock clk  -max 2.5  [get_ports {cur_input1[10]}]
set_input_delay -clock clk  -max 2.5  [get_ports {cur_input1[9]}]
set_input_delay -clock clk  -max 2.5  [get_ports {cur_input1[8]}]
set_input_delay -clock clk  -max 2.5  [get_ports {cur_input1[7]}]
set_input_delay -clock clk  -max 2.5  [get_ports {cur_input1[6]}]
set_input_delay -clock clk  -max 2.5  [get_ports {cur_input1[5]}]
set_input_delay -clock clk  -max 2.5  [get_ports {cur_input1[4]}]
set_input_delay -clock clk  -max 2.5  [get_ports {cur_input1[3]}]
set_input_delay -clock clk  -max 2.5  [get_ports {cur_input1[2]}]
set_input_delay -clock clk  -max 2.5  [get_ports {cur_input1[1]}]
set_input_delay -clock clk  -max 2.5  [get_ports {cur_input1[0]}]
set_input_delay -clock clk  -max 2.5  [get_ports {ref0[3]}]
set_input_delay -clock clk  -max 2.5  [get_ports {ref0[2]}]
set_input_delay -clock clk  -max 2.5  [get_ports {ref0[1]}]
set_input_delay -clock clk  -max 2.5  [get_ports {ref0[0]}]
set_input_delay -clock clk  -max 2.5  [get_ports {ref1[3]}]
set_input_delay -clock clk  -max 2.5  [get_ports {ref1[2]}]
set_input_delay -clock clk  -max 2.5  [get_ports {ref1[1]}]
set_input_delay -clock clk  -max 2.5  [get_ports {ref1[0]}]
set_input_delay -clock clk  -max 2.5  [get_ports {ref2[3]}]
set_input_delay -clock clk  -max 2.5  [get_ports {ref2[2]}]
set_input_delay -clock clk  -max 2.5  [get_ports {ref2[1]}]
set_input_delay -clock clk  -max 2.5  [get_ports {ref2[0]}]
set_input_delay -clock clk  -max 2.5  [get_ports {ref3[3]}]
set_input_delay -clock clk  -max 2.5  [get_ports {ref3[2]}]
set_input_delay -clock clk  -max 2.5  [get_ports {ref3[1]}]
set_input_delay -clock clk  -max 2.5  [get_ports {ref3[0]}]
set_input_delay -clock clk  -max 2.5  [get_ports {ref4[3]}]
set_input_delay -clock clk  -max 2.5  [get_ports {ref4[2]}]
set_input_delay -clock clk  -max 2.5  [get_ports {ref4[1]}]
set_input_delay -clock clk  -max 2.5  [get_ports {ref4[0]}]
set_input_delay -clock clk  -max 2.5  [get_ports {ref5[3]}]
set_input_delay -clock clk  -max 2.5  [get_ports {ref5[2]}]
set_input_delay -clock clk  -max 2.5  [get_ports {ref5[1]}]
set_input_delay -clock clk  -max 2.5  [get_ports {ref5[0]}]
set_input_delay -clock clk  -max 2.5  [get_ports {ref6[3]}]
set_input_delay -clock clk  -max 2.5  [get_ports {ref6[2]}]
set_input_delay -clock clk  -max 2.5  [get_ports {ref6[1]}]
set_input_delay -clock clk  -max 2.5  [get_ports {ref6[0]}]
set_input_delay -clock clk  -max 2.5  [get_ports {ref7[3]}]
set_input_delay -clock clk  -max 2.5  [get_ports {ref7[2]}]
set_input_delay -clock clk  -max 2.5  [get_ports {ref7[1]}]
set_input_delay -clock clk  -max 2.5  [get_ports {ref7[0]}]
set_input_delay -clock clk  -max 2.5  [get_ports {ref8[3]}]
set_input_delay -clock clk  -max 2.5  [get_ports {ref8[2]}]
set_input_delay -clock clk  -max 2.5  [get_ports {ref8[1]}]
set_input_delay -clock clk  -max 2.5  [get_ports {ref8[0]}]
set_input_delay -clock clk  -max 2.5  [get_ports {ref9[3]}]
set_input_delay -clock clk  -max 2.5  [get_ports {ref9[2]}]
set_input_delay -clock clk  -max 2.5  [get_ports {ref9[1]}]
set_input_delay -clock clk  -max 2.5  [get_ports {ref9[0]}]
set_input_delay -clock clk  -max 2.5  [get_ports {ref10[3]}]
set_input_delay -clock clk  -max 2.5  [get_ports {ref10[2]}]
set_input_delay -clock clk  -max 2.5  [get_ports {ref10[1]}]
set_input_delay -clock clk  -max 2.5  [get_ports {ref10[0]}]
set_input_delay -clock clk  -max 2.5  [get_ports {ref11[3]}]
set_input_delay -clock clk  -max 2.5  [get_ports {ref11[2]}]
set_input_delay -clock clk  -max 2.5  [get_ports {ref11[1]}]
set_input_delay -clock clk  -max 2.5  [get_ports {ref11[0]}]
set_input_delay -clock clk  -max 2.5  [get_ports {ref12[3]}]
set_input_delay -clock clk  -max 2.5  [get_ports {ref12[2]}]
set_input_delay -clock clk  -max 2.5  [get_ports {ref12[1]}]
set_input_delay -clock clk  -max 2.5  [get_ports {ref12[0]}]
set_input_delay -clock clk  -max 2.5  [get_ports {ref13[3]}]
set_input_delay -clock clk  -max 2.5  [get_ports {ref13[2]}]
set_input_delay -clock clk  -max 2.5  [get_ports {ref13[1]}]
set_input_delay -clock clk  -max 2.5  [get_ports {ref13[0]}]
set_input_delay -clock clk  -max 2.5  [get_ports {ref14[3]}]
set_input_delay -clock clk  -max 2.5  [get_ports {ref14[2]}]
set_input_delay -clock clk  -max 2.5  [get_ports {ref14[1]}]
set_input_delay -clock clk  -max 2.5  [get_ports {ref14[0]}]
set_input_delay -clock clk  -max 2.5  [get_ports {ref15[3]}]
set_input_delay -clock clk  -max 2.5  [get_ports {ref15[2]}]
set_input_delay -clock clk  -max 2.5  [get_ports {ref15[1]}]
set_input_delay -clock clk  -max 2.5  [get_ports {ref15[0]}]
set_input_delay -clock clk  -max 2.5  [get_ports {ref16[3]}]
set_input_delay -clock clk  -max 2.5  [get_ports {ref16[2]}]
set_input_delay -clock clk  -max 2.5  [get_ports {ref16[1]}]
set_input_delay -clock clk  -max 2.5  [get_ports {ref16[0]}]
set_input_delay -clock clk  -max 2.5  [get_ports {ref17[3]}]
set_input_delay -clock clk  -max 2.5  [get_ports {ref17[2]}]
set_input_delay -clock clk  -max 2.5  [get_ports {ref17[1]}]
set_input_delay -clock clk  -max 2.5  [get_ports {ref17[0]}]
set_input_delay -clock clk  -max 2.5  [get_ports {ref18[3]}]
set_input_delay -clock clk  -max 2.5  [get_ports {ref18[2]}]
set_input_delay -clock clk  -max 2.5  [get_ports {ref18[1]}]
set_input_delay -clock clk  -max 2.5  [get_ports {ref18[0]}]
set_input_delay -clock clk  -max 2.5  [get_ports {ref19[3]}]
set_input_delay -clock clk  -max 2.5  [get_ports {ref19[2]}]
set_input_delay -clock clk  -max 2.5  [get_ports {ref19[1]}]
set_input_delay -clock clk  -max 2.5  [get_ports {ref19[0]}]
set_input_delay -clock clk  -max 2.5  [get_ports {ref20[3]}]
set_input_delay -clock clk  -max 2.5  [get_ports {ref20[2]}]
set_input_delay -clock clk  -max 2.5  [get_ports {ref20[1]}]
set_input_delay -clock clk  -max 2.5  [get_ports {ref20[0]}]
set_input_delay -clock clk  -max 2.5  [get_ports {ref21[3]}]
set_input_delay -clock clk  -max 2.5  [get_ports {ref21[2]}]
set_input_delay -clock clk  -max 2.5  [get_ports {ref21[1]}]
set_input_delay -clock clk  -max 2.5  [get_ports {ref21[0]}]
set_input_delay -clock clk  -max 2.5  [get_ports {ref22[3]}]
set_input_delay -clock clk  -max 2.5  [get_ports {ref22[2]}]
set_input_delay -clock clk  -max 2.5  [get_ports {ref22[1]}]
set_input_delay -clock clk  -max 2.5  [get_ports {ref22[0]}]
set_output_delay -clock clk  -max 2.5  [get_ports finish_flag]
set_output_delay -clock clk  -max 2.5  [get_ports ber]
set_output_delay -clock clk  -max 2.5  [get_ports {cur_ad[22]}]
set_output_delay -clock clk  -max 2.5  [get_ports {cur_ad[21]}]
set_output_delay -clock clk  -max 2.5  [get_ports {cur_ad[20]}]
set_output_delay -clock clk  -max 2.5  [get_ports {cur_ad[19]}]
set_output_delay -clock clk  -max 2.5  [get_ports {cur_ad[18]}]
set_output_delay -clock clk  -max 2.5  [get_ports {cur_ad[17]}]
set_output_delay -clock clk  -max 2.5  [get_ports {cur_ad[16]}]
set_output_delay -clock clk  -max 2.5  [get_ports {cur_ad[15]}]
set_output_delay -clock clk  -max 2.5  [get_ports {cur_ad[14]}]
set_output_delay -clock clk  -max 2.5  [get_ports {cur_ad[13]}]
set_output_delay -clock clk  -max 2.5  [get_ports {cur_ad[12]}]
set_output_delay -clock clk  -max 2.5  [get_ports {cur_ad[11]}]
set_output_delay -clock clk  -max 2.5  [get_ports {cur_ad[10]}]
set_output_delay -clock clk  -max 2.5  [get_ports {cur_ad[9]}]
set_output_delay -clock clk  -max 2.5  [get_ports {cur_ad[8]}]
set_output_delay -clock clk  -max 2.5  [get_ports {cur_ad[7]}]
set_output_delay -clock clk  -max 2.5  [get_ports {cur_ad[6]}]
set_output_delay -clock clk  -max 2.5  [get_ports {cur_ad[5]}]
set_output_delay -clock clk  -max 2.5  [get_ports {cur_ad[4]}]
set_output_delay -clock clk  -max 2.5  [get_ports {cur_ad[3]}]
set_output_delay -clock clk  -max 2.5  [get_ports {cur_ad[2]}]
set_output_delay -clock clk  -max 2.5  [get_ports {cur_ad[1]}]
set_output_delay -clock clk  -max 2.5  [get_ports {cur_ad[0]}]
set_output_delay -clock clk  -max 2.5  [get_ports {ref_ad[22]}]
set_output_delay -clock clk  -max 2.5  [get_ports {ref_ad[21]}]
set_output_delay -clock clk  -max 2.5  [get_ports {ref_ad[20]}]
set_output_delay -clock clk  -max 2.5  [get_ports {ref_ad[19]}]
set_output_delay -clock clk  -max 2.5  [get_ports {ref_ad[18]}]
set_output_delay -clock clk  -max 2.5  [get_ports {ref_ad[17]}]
set_output_delay -clock clk  -max 2.5  [get_ports {ref_ad[16]}]
set_output_delay -clock clk  -max 2.5  [get_ports {ref_ad[15]}]
set_output_delay -clock clk  -max 2.5  [get_ports {ref_ad[14]}]
set_output_delay -clock clk  -max 2.5  [get_ports {ref_ad[13]}]
set_output_delay -clock clk  -max 2.5  [get_ports {ref_ad[12]}]
set_output_delay -clock clk  -max 2.5  [get_ports {ref_ad[11]}]
set_output_delay -clock clk  -max 2.5  [get_ports {ref_ad[10]}]
set_output_delay -clock clk  -max 2.5  [get_ports {ref_ad[9]}]
set_output_delay -clock clk  -max 2.5  [get_ports {ref_ad[8]}]
set_output_delay -clock clk  -max 2.5  [get_ports {ref_ad[7]}]
set_output_delay -clock clk  -max 2.5  [get_ports {ref_ad[6]}]
set_output_delay -clock clk  -max 2.5  [get_ports {ref_ad[5]}]
set_output_delay -clock clk  -max 2.5  [get_ports {ref_ad[4]}]
set_output_delay -clock clk  -max 2.5  [get_ports {ref_ad[3]}]
set_output_delay -clock clk  -max 2.5  [get_ports {ref_ad[2]}]
set_output_delay -clock clk  -max 2.5  [get_ports {ref_ad[1]}]
set_output_delay -clock clk  -max 2.5  [get_ports {ref_ad[0]}]
set_output_delay -clock clk  -max 2.5  [get_ports {min_sad0[13]}]
set_output_delay -clock clk  -max 2.5  [get_ports {min_sad0[12]}]
set_output_delay -clock clk  -max 2.5  [get_ports {min_sad0[11]}]
set_output_delay -clock clk  -max 2.5  [get_ports {min_sad0[10]}]
set_output_delay -clock clk  -max 2.5  [get_ports {min_sad0[9]}]
set_output_delay -clock clk  -max 2.5  [get_ports {min_sad0[8]}]
set_output_delay -clock clk  -max 2.5  [get_ports {min_sad0[7]}]
set_output_delay -clock clk  -max 2.5  [get_ports {min_sad0[6]}]
set_output_delay -clock clk  -max 2.5  [get_ports {min_sad0[5]}]
set_output_delay -clock clk  -max 2.5  [get_ports {min_sad0[4]}]
set_output_delay -clock clk  -max 2.5  [get_ports {min_sad0[3]}]
set_output_delay -clock clk  -max 2.5  [get_ports {min_sad0[2]}]
set_output_delay -clock clk  -max 2.5  [get_ports {min_sad0[1]}]
set_output_delay -clock clk  -max 2.5  [get_ports {min_sad0[0]}]
set_output_delay -clock clk  -max 2.5  [get_ports {min_sad1[13]}]
set_output_delay -clock clk  -max 2.5  [get_ports {min_sad1[12]}]
set_output_delay -clock clk  -max 2.5  [get_ports {min_sad1[11]}]
set_output_delay -clock clk  -max 2.5  [get_ports {min_sad1[10]}]
set_output_delay -clock clk  -max 2.5  [get_ports {min_sad1[9]}]
set_output_delay -clock clk  -max 2.5  [get_ports {min_sad1[8]}]
set_output_delay -clock clk  -max 2.5  [get_ports {min_sad1[7]}]
set_output_delay -clock clk  -max 2.5  [get_ports {min_sad1[6]}]
set_output_delay -clock clk  -max 2.5  [get_ports {min_sad1[5]}]
set_output_delay -clock clk  -max 2.5  [get_ports {min_sad1[4]}]
set_output_delay -clock clk  -max 2.5  [get_ports {min_sad1[3]}]
set_output_delay -clock clk  -max 2.5  [get_ports {min_sad1[2]}]
set_output_delay -clock clk  -max 2.5  [get_ports {min_sad1[1]}]
set_output_delay -clock clk  -max 2.5  [get_ports {min_sad1[0]}]
set_output_delay -clock clk  -max 2.5  [get_ports finish_a_cur0]
set_output_delay -clock clk  -max 2.5  [get_ports finish_a_cur1]
set_output_delay -clock clk  -max 2.5  [get_ports {mv_x0[3]}]
set_output_delay -clock clk  -max 2.5  [get_ports {mv_x0[2]}]
set_output_delay -clock clk  -max 2.5  [get_ports {mv_x0[1]}]
set_output_delay -clock clk  -max 2.5  [get_ports {mv_x0[0]}]
set_output_delay -clock clk  -max 2.5  [get_ports {mv_y0[3]}]
set_output_delay -clock clk  -max 2.5  [get_ports {mv_y0[2]}]
set_output_delay -clock clk  -max 2.5  [get_ports {mv_y0[1]}]
set_output_delay -clock clk  -max 2.5  [get_ports {mv_y0[0]}]
set_output_delay -clock clk  -max 2.5  [get_ports {mv_x1[3]}]
set_output_delay -clock clk  -max 2.5  [get_ports {mv_x1[2]}]
set_output_delay -clock clk  -max 2.5  [get_ports {mv_x1[1]}]
set_output_delay -clock clk  -max 2.5  [get_ports {mv_x1[0]}]
set_output_delay -clock clk  -max 2.5  [get_ports {mv_y1[3]}]
set_output_delay -clock clk  -max 2.5  [get_ports {mv_y1[2]}]
set_output_delay -clock clk  -max 2.5  [get_ports {mv_y1[1]}]
set_output_delay -clock clk  -max 2.5  [get_ports {mv_y1[0]}]
